In [84]:
import pandas as pd

# 1. Series (1D)

In [85]:
series=pd.Series([1,2,23,4],index=["a",'b','c','d'])
series2=pd.Series([1,2,3,4])

In [86]:
series

a     1
b     2
c    23
d     4
dtype: int64

In [87]:
series2

0    1
1    2
2    3
3    4
dtype: int64

In [88]:
print(series['a'])

1

# 2. DataFrame (2D)

In [89]:
dataframe=pd.DataFrame({
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
})

In [90]:
dict={
    "name":["anil","sunil","reshma"],
    "marks":[91,67,100]
}

dataframe_1=pd.DataFrame(dict)

In [91]:
data_frame_3=[["anil",91],["sunil",100]]
dataframe_3=pd.DataFrame(data_frame_3,columns=["name","marks"])

In [92]:
dataframe

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [93]:
dataframe_1

     name  marks
0    anil     91
1   sunil     67
2  reshma    100

In [94]:
dataframe_3

    name  marks
0   anil     91
1  sunil    100

# 3 Data Import & Export Operations

```python
pd.read_csv('file.csv')
pd.read_excel('file.xlsx')
pd.read_json('file.json')
pd.read_sql(query, connection)
```

In [95]:
student_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\students.csv")
courses_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\courses.csv")
enrolment_data=pd.read_csv(r"R:\DATA_ANALYTICS\python\pandas\enrollments.csv")

```python 
df.to_csv('out.csv', index=False)
df.to_excel('out.xlsx')
df.to_json('out.json')
```

```python

# 4 Basic Data Inspection

In [96]:
student_data.head()

   student_id   name   age        department
0           1   Amit  20.0  Computer Science
1           2   Neha  21.0        Mechanical
2           3  Rahul  19.0        Electrical
3           4  Priya  22.0  Computer Science
4           5  Karan   NaN             Civil

In [97]:
student_data.tail()

    student_id     name   age        department
45          46    Rekha  21.0        Electrical
46          47    Lalit  22.0             Civil
47          48    Swati  20.0  Computer Science
48          49  Prakash  21.0               NaN
49          50   Monika  22.0        Mechanical

In [98]:
student_data.shape

(50, 4)

In [99]:
student_data.columns

Index(['student_id', 'name', 'age', 'department'], dtype='object')

In [100]:
student_data.index

RangeIndex(start=0, stop=50, step=1)

In [101]:
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  50 non-null     int64
 1   name        50 non-null     object
 2   age         42 non-null     float64
 3   department  47 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 1.7+ KB

In [102]:
student_data.describe()

       student_id        age
count    50.00000  42.000000
mean     25.50000  20.738095
std      14.57738   1.127473
min       1.00000  19.000000
25%      13.25000  20.000000
50%      25.50000  21.000000
75%      37.75000  22.000000
max      50.00000  23.000000

``` python

```python

# 5 Column Operations

SELECT COLUMN

In [103]:
age=student_data['age']

SELECT MULTIPLE COLUMNS

In [104]:
name_age=student_data[['name','age']]

ADD NEW COLUMNS

In [105]:
enrolment_data['passed']=enrolment_data['marks']>80

In [106]:
enrolment_data.head()

  enrollment_id  student_id  course_id  semester  marks  passed
0             1         1.0      101.0       1.0   85.0    True
1             2         1.0      102.0       1.0   78.0   False
2             3         2.0      201.0       1.0   72.0   False
3             4         3.0      301.0       1.0   68.0   False
4             5         4.0      101.0       1.0   91.0    True

RENAME COLUMN

In [108]:
student_data.rename(columns={"name":"new_name"},inplace=True)

In [109]:
student_data.head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil

DROP column

In [113]:
student_data.drop("new_name",axis=1).head()

   student_id   age        department
0           1  20.0  Computer Science
1           2  21.0        Mechanical
2           3  19.0        Electrical
3           4  22.0  Computer Science
4           5   NaN             Civil

```python

```python

# 6 Row Operations

iloc

In [115]:
student_data.iloc[::].head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
1           2     Neha  21.0        Mechanical
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil

FILTER DATA

In [117]:
student_data[student_data["age"]>21]

    student_id new_name   age        department
3            4    Priya  22.0  Computer Science
8            9    Rohan  22.0        Electrical
10          11   Vikram  23.0             Civil
14          15   Suresh  22.0             Civil
18          19    Mohan  22.0               NaN
22          23    Nitin  22.0             Civil
26          27   Harish  22.0             Civil
30          31     Ajay  22.0             Civil
34          35     Alok  22.0             Civil
38          39   Girish  22.0             Civil
42          43    Anand  22.0             Civil
46          47    Lalit  22.0             Civil
49          50   Monika  22.0        Mechanical

DROP ROW

In [119]:
student_data.drop(1).head()

   student_id new_name   age        department
0           1     Amit  20.0  Computer Science
2           3    Rahul  19.0        Electrical
3           4    Priya  22.0  Computer Science
4           5    Karan   NaN             Civil
5           6    Sneha  20.0               NaN

 # 8 Sorting Operations

SORT values

In [121]:
student_data.sort_values("age").head(5)

    student_id new_name   age        department
2            3    Rahul  19.0        Electrical
43          44   Shruti  19.0  Computer Science
37          38    Komal  19.0        Electrical
7            8    Pooja  19.0        Mechanical
31          32    Payal  19.0  Computer Science

In [123]:
student_data.sort_values("age",ascending=False).head()

    student_id new_name   age        department
10          11   Vikram  23.0             Civil
49          50   Monika  22.0        Mechanical
30          31     Ajay  22.0             Civil
26          27   Harish  22.0             Civil
3            4    Priya  22.0  Computer Science